[
  {
    "id": 0,
    "name": "Giao thông trên đường phố",
    "situations": [
      {
        "id": 1,
        "desc": "Người đi bộ sang đường khuất sau xe tải",
        "ask": "Khi di chuyển trong khu vực đông dân cư phía trước có vạch kẻ đường dành cho người đi bộ , bất chợt gặp người đi bộ băng cắt qua đường chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện người đi bộ trên vạch người đi bộ qua đường khuất sau đuôi xe tải xuất hiện",
        "explain": "Khi di chuyển trong khu vực đông dân cư, bất chợt gặp người đi bộ băng cắt qua đường chúng ta cần đạp chân phanh để xe chạy chậm lại, thậm chí cần phải dừng lại một chút đề nhường đường cho người đi bộ băng cắt qua đường. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển.",
        "passFrom": 112,
        "passTo": 141,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 220
      },
      {
        "id": 2,
        "desc": "Người đi bộ băng qua đường phía trước có ô tô",
        "ask": "Khi di chuyển trong khu vực đông dân cư phía trước có xe ô tô đang di chuyển, 2 bên đều có xe đỗ lề đường. Xe đang di chuyển đến giao lộ có tín hiệu đèn xanh đèn đỏ, hiện đèn tín hiệu vẫn đang có màu xanh tuy nhiên phát hiện thấy có người đi bộ băng cắt qua đường thì chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm người đi bộ qua đường vừa đặt chân lên dải phân cách",
        "explain": "Khi di chuyển trong khu vực đông dân cư phía trước có xe ô tô đang di chuyển, 2 bên đều có xe đỗ lề đường. Xe đang di chuyển đến giao lộ có tín hiệu đèn xanh đèn đỏ, hiện đèn tín hiệu vẫn đang có màu xanh tuy nhiên phát hiện thấy có người đi bộ băng cắt qua đường thì chúng ta cần đạp chân phanh để xe chạy chậm lại, thậm chí cần phải dừng lại một chút đề nhường đường cho người đi bộ băng cắt qua đường. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển.",
        "passFrom": 160,
        "passTo": 177,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 283
      },
      {
        "id": 3,
        "desc": "Xe phía trước phanh gấp",
        "ask": "Khi di chuyển trong khu vực đông dân cư phía trước có xe ô tô đang di chuyển thì bất ngờ xe phía trước phanh gấp thì chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đèn phanh của xe phía trước sáng lên",
        "explain": " Khi di chuyển trong khu vực đông dân cư phía trước có xe ô tô đang di chuyển thì bất ngờ xe phía trước phanh gấp thì chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển.",
        "passFrom": 155,
        "passTo": 181,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 283
      },
      {
        "id": 4,
        "desc": "Tránh xe rẽ tại nút giao",
        "ask": "Khi di chuyển trong khu vực đông dân cư và trong điều kiện thời tiết có mưa đường trơn trượt, khi qua ngã ba phát hiện thấy xe ở đường khác tiến hành nhập làn trước, chúng ta cần phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe ô tô đen bên ngã rẽ phải (2/3 xe)",
        "explain": "Khi di chuyển trong khu vực đông dân cư và trong điều kiện thời tiết có mưa đường trơn trượt, khi qua ngã ba phát hiện thấy xe ở đường khác tiến hành nhập làn trước chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển",
        "passFrom": 151,
        "passTo": 183,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 313
      },
      {
        "id": 5,
        "desc": "Tránh xe máy rẽ ẩu",
        "ask": "Khi di chuyển trong khu vực đông dân cư bất chợt có xe máy chuyển làn ẩu không xi nhan bạn cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện chiếc xe máy phía trên ô tô đỏ bắt đầu rẽ trái chuyển làn bất ngờ",
        "explain": "Khi di chuyển trong khu vực đông dân cư khi đến khu vực ngã ba phát hiện xe Bus ở hướng đối diện có ý định vượt phải chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển.",
        "passFrom": 74,
        "passTo": 95,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 238
      },
      {
        "id": 6,
        "desc": "Tránh xe máy rẽ ẩu",
        "ask": "Khi di chuyển trong khu vực đông dân cư khi đến khu vực ngã ba phát hiện xe Bus ở hướng đối diện có ý định vượt phải chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện chiếc xe bus đánh đầu xe ra để né xe con màu đỏ dừng đỗ bên đường.",
        "explain": "Khi di chuyển trong khu vực đông dân cư khi đến khu vực ngã ba phát hiện xe Bus ở hướng đối diện có ý định vượt phải chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển",
        "passFrom": 143,
        "passTo": 172,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 260
      },
      {
        "id": 7,
        "desc": "Xe phía trước dừng đột ngột để tránh người đi bộ",
        "ask": "Khi di chuyển trong khu vực đông dân cư khi đến khu vực giao lộ, trước mắt là đèn xanh tuy nhiên đang có người đi bộ băng cắt qua đường chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện chiếc xe trắng phía trước sáng đèn xe để tránh người đi bộ",
        "explain": "Khi di chuyển trong khu vực đông dân cư khi đến khu vực giao lộ, trước mắt là đèn xanh tuy nhiên đang có người đi bộ băng cắt qua đường chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 116,
        "passTo": 161,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 285
      },
      {
        "id": 8,
        "desc": "Phương tiện thô sơ sang đường",
        "ask": "Khi di chuyển trong khu vực đông dân cư khi đến khu vực giao lộ, bỗng có xe đạp phía bên trái băng qua giao lộ chúng ta cần làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện người đi xe đạp xuất hiện trong tầm nhìn",
        "explain": "Khi di chuyển trong khu vực đông dân cư khi đến khu vực giao lộ, bỗng có xe đạp phía bên trái băng qua giao lộ chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 124,
        "passTo": 153,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 312
      },
      {
        "id": 9,
        "desc": "Lấn làn vượt xe",
        "ask": "Khi di chuyển trong khu vực đông dân cư đường đôi có dải phân cách bỗng chợt phía đối diện có xe ô tô lấn làn vượt ẩu chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đầu xe con bắt đầu đánh lái lấn lên vạch kẻ đường",
        "explain": "Khi di chuyển trong khu vực đông dân cư đường đôi có dải phân cách bỗng chợt phía đối diện có xe ô tô lấn làn vượt ẩu chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 97,
        "passTo": 123,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 193
      },
      {
        "id": 10,
        "desc": "Xe ô tô từ đường nhánh nhập vào đường chính",
        "ask": "Khi di chuyển trong khu vực đông dân cư đến ngã ba thì phát hiện bên phía tay trái có xe ô tô vào giao lộ trước chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện gần hết chiếc ô tô con từ đường nhánh đi ra",
        "explain": "Khi di chuyển trong khu vực đông dân cư đến ngã ba thì phát hiện bên phía tay trái có xe ô tô vào giao lộ trước chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 135,
        "passTo": 177,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 268
      },
      {
        "id": 11,
        "desc": "Xe bồn lấn làn vượt xe",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe bồn có tín hiệu xin vượt ở hướng ngược lại chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm đầu xe bồn bắt đầu xuất hiện",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe bồn có tín hiệu xin vượt ở hướng ngược lại chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 143,
        "passTo": 207,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 299
      },
      {
        "id": 12,
        "desc": "Khi xe ô tô đối diện có tín hiệu đèn rẽ trái",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô ở chiều ngược lại có tín hiệu đèn xin rẽ trái chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe con bắt đầu rẽ trái (sau khi bật xi nhan)",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô ở chiều ngược lại có tín hiệu đèn xin rẽ trái chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 203,
        "passTo": 237,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 296
      },
      {
        "id": 13,
        "desc": "Xe đạp băng cắt qua đường",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe đạp phía trước có chiều hướng băng qua đường chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe đạp bắt đầu xuống lòng đường (vừa thấy người tới vạch kẻ đường)",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe đạp phía trước có chiều hướng băng qua đường chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 123,
        "passTo": 144,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 253
      },
      {
        "id": 14,
        "desc": "Lưu thông qua hầm đường bộ",
        "ask": "Khi di chuyển trong khu vực thành thị, khu đông dân cư phía trước là hầm đường bộ và có biển báo đường hẹp, ngay khi phát hiện ô tô tải phía đường ngược lại trước cửa hầm chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm đầu xe tải xuất hiện từ xa",
        "explain": "Khi di chuyển trong khu vực thành thị, khu đông dân cư phía trước là hầm đường bộ và có biển báo đường hẹp, ngay khi phát hiện ô tô tải phía đường ngược lại trước cửa hầm chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 157,
        "passTo": 192,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 294
      },
      {
        "id": 15,
        "desc": "Xe tải phía trước dừng bất ngờ",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô tải phía trước bất ngờ dừng lại có tín hiệu đèn đỏ ở phía sau xe chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm thấy tín hiệu đèn phanh của xe tải sáng lên",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô tải phía trước bất ngờ dừng lại có tín hiệu đèn đỏ ở phía sau xe chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển",
        "passFrom": 137,
        "passTo": 163,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 285
      },
      {
        "id": 16,
        "desc": "Xe ô tô đường nhánh vượt ẩu",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô ở phía tay trái có khả năng vượt ẩu chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện trong tầm nhìn bên phía trái xe con màu xám đi ra từ đường nhánh (xuất hiện 1/2 xe)",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô ở phía tay trái có khả năng vượt ẩu chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 126,
        "passTo": 150,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 252
      },
      {
        "id": 17,
        "desc": "Xe bus lấn làn vượt ẩu",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô BUS ở chiều ngược có dấu hiệu lấn làn vượt ẩu chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm thấy hết đầu xe bus (hoặc thấy người đi xe máy cùng chiều phía trước mặt dừng xe lại).",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô BUS ở chiều ngược có dấu hiệu lấn làn vượt ẩu chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 106,
        "passTo": 136,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 327
      },
      {
        "id": 18,
        "desc": "Xe tải phía trước vượt ẩu",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô tải phía trước có động thái vượt ẩu chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện vạch đứt màu trắng ở giữa xe tải phía trước và đuôi ô tô tải và ô tô con màu trắng ngang nhau.",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô tải phía trước có động thái vượt ẩu chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 140,
        "passTo": 174,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 296
      },
      {
        "id": 19,
        "desc": "Xe cùng chiều dừng bên đường có tín hiệu đèn cảnh báo nguy hiểm",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô cùng chiều bật tín hiệu đèn cảnh báo nguy hiểm chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe ô tô đỏ ngược chiều phía trước đá đèn lần 2",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô cùng chiều bật tín hiệu đèn cảnh báo nguy hiểm chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 142,
        "passTo": 164,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 249
      },
      {
        "id": 20,
        "desc": "Xe ô tô dựng lề đường cùng chiều có tín hiệu xin nhập làn",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô ở cùng chiều có tín hiệu xi nhan xin nhập làn chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đèn xi nhan của xe phía trước sáng lên",
        "explain": " Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô ở cùng chiều có tín hiệu xi nhan xin nhập làn chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 164,
        "passTo": 186,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 267
      },
      {
        "id": 21,
        "desc": "Xe ô tô phía trước có tín hiệu dừng xe",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô phía trước có tín hiệu dừng xe chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đèn đuôi xe trắng phía trước bật sáng lên",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô phía trước có tín hiệu dừng xe chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 163,
        "passTo": 193,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 358
      },
      {
        "id": 22,
        "desc": "Phát hiện xe ô tô đường nhánh đang vào giao lộ",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô ở đường nhánh vào giao lộ trước và có chiều hướng rẽ trái chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đầu xe phía trước xuất hiện",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô ở đường nhánh vào giao lộ trước và có chiều hướng rẽ trái chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển",
        "passFrom": 140,
        "passTo": 167,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 275
      },
      {
        "id": 23,
        "desc": "Xe ô tô vượt ẩu",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô ở chiều ngược lại có dấu hiệu lấn làn vượt chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe ngược chiều phía trước đè lên vạch đứt trắng",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô ở chiều ngược lại có dấu hiệu lấn làn vượt chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 163,
        "passTo": 200,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 289
      },
      {
        "id": 24,
        "desc": "Xe tải lấn làn vượt",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô tải ở chiều ngược lại dấu hiệu lấn làn vượt chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe tải bắt đầu đè vạch đứt vàng (vạch tim đường)",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô tải ở chiều ngược lại dấu hiệu lấn làn vượt chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 156,
        "passTo": 182,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 298
      },
      {
        "id": 25,
        "desc": "Xe Bus đỏ lấn làn vượt ẩu",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô BUS màu đỏ ở chiều ngược lại có tín hiệu đèn xin vượt chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe khách bắt đầu bật xi nhan trái và rẽ trái",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô BUS màu đỏ ở chiều ngược lại có tín hiệu đèn xin vượt chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 115,
        "passTo": 200,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 406
      },
      {
        "id": 26,
        "desc": "Phía trước có đường đang sửa chữa",
        "ask": " Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện phía trước có đường đang sửa chữa chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đầu xe con màu trắng xuất hiện",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện phía trước có đường đang sửa chữa chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 147,
        "passTo": 187,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 383
      },
      {
        "id": 27,
        "desc": "Đèn xanh nhưng xe phía trước vẫn chưa di chuyển",
        "ask": "Khi di chuyển trong khu vực đông dân cư đến giao lộ đèn phía trước đang từ đỏ chuyển sang xanh tuy nhiên xe phía trước bật cảnh báo nguy hiểm và chưa có chiều hướng di chuyển chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đèn bắt đầu chuyển xanh",
        "explain": "Khi di chuyển trong khu vực đông dân cư đến giao lộ đèn phía trước đang từ đỏ chuyển sang xanh tuy nhiên xe phía trước bật cảnh báo nguy hiểm và chưa có chiều hướng di chuyển chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 151,
        "passTo": 171,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 291
      },
      {
        "id": 28,
        "desc": "Xe phía trước bất chợt dừng",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô phía trước bất chợt dừng đột ngột chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đèn phanh xe phía trước bật sáng lên",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô phía trước bất chợt dừng đột ngột chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 136,
        "passTo": 165,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 312
      },
      {
        "id": 29,
        "desc": "Xe phía trước bất chợt dừng\r\n",
        "ask": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô phía trước bất chợt dừng đột ngột chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đèn phanh xe phía trước sáng lên",
        "explain": "Khi di chuyển trong khu vực đông dân cư bỗng chợt phát hiện xe ô tô phía trước bất chợt dừng đột ngột chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 136,
        "passTo": 165,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 297
      }
    ]
  },
  {
    "id": 1,
    "name": "Giao thông trên đường ở nông thôn",
    "situations": [
      {
        "id": 30,
        "desc": "Phương tiện đi trên đường đê xuất hiện gia súc giữa đường",
        "ask": "Khi di chuyển trong khu vực ngoại thành phát hiện phía trước có gia súc tràn ra đường chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện gia súc ở đường",
        "explain": "Khi di chuyển trong khu vực ngoại thành phát hiện phía trước có gia súc tràn ra đường chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 106,
        "passTo": 155,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 324
      },
      {
        "id": 31,
        "desc": "Gia súc di chuyển sang đường",
        "ask": "Khi di chuyển trong khu vực ngoại thành phát hiện phía trước có di chuyển sang đường chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện gia súc di chuyển sang đường",
        "explain": "Khi di chuyển trong khu vực ngoại thành phát hiện phía trước có di chuyển sang đường chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 150,
        "passTo": 191,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 339
      },
      {
        "id": 32,
        "desc": "Phương tiện đang đi thẳng người đi bộ có xu hướng chạy cắt qua sau đó lùi lại\r\n",
        "ask": "Khi di chuyển trong khu vực ngoại thành đường tối tại gần khúc cua phát hiện phía trước có người di chuyển sang đường chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện người đi bộ bước chân sang đường.",
        "explain": "Khi di chuyển trong khu vực ngoại thành đường tối tại gần khúc cua phát hiện phía trước có người di chuyển sang đường chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 110,
        "passTo": 130,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 310
      },
      {
        "id": 33,
        "desc": "Phương tiện đang đi thẳng xuất hiện trẻ em phía trước",
        "ask": "Khi di chuyển trong khu vực ngoại thành đường tối tại gần khúc cua phát hiện phía trước có người di chuyển phía trước chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện người đi bộ đi tới cột màu xanh, trái đường",
        "explain": "Khi di chuyển trong khu vực ngoại thành đường tối tại gần khúc cua phát hiện phía trước có người di chuyển phía trước chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 133,
        "passTo": 164,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 288
      },
      {
        "id": 34,
        "desc": "Phương tiện đang đi chỗ đoạn đường cong phía trước có xe khách đang vượt xe đạp",
        "ask": "Khi di chuyển trong khu vực ngoại thành tại gần khúc cua phát hiện phía trước có xe khách đang vượt xe tải ở chiều ngược lại chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đầu xe khách xuất hiện vừa che khuất người đi xe đạp.",
        "explain": "Khi di chuyển trong khu vực ngoại thành tại gần khúc cua phát hiện phía trước có xe khách đang vượt xe tải ở chiều ngược lại chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 92,
        "passTo": 134,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 215
      },
      {
        "id": 35,
        "desc": "Xe khách phía trước có tín hiệu giảm tốc",
        "ask": "Khi di chuyển trong khu vực ngoại thành tại gần khúc cua phát hiện phía trước có xe khách có tín hiệu giảm tốc chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đèn phanh xe khách phía trước sáng lên.",
        "explain": "Khi di chuyển trong khu vực ngoại thành tại gần khúc cua phát hiện phía trước có xe khách có tín hiệu giảm tốc chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 81,
        "passTo": 107,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 247
      },
      {
        "id": 36,
        "desc": "Phương tiện đang đi qua đoạn đường có nhiều giao cắt bất ngờ xuất hiện xe máy từ ngõ ra",
        "ask": "Khi di chuyển trong khu vực ngoại thành khi di chuyển tới gần khu vực ngã ba có phương tiện di chuyển qua lại chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi người phụ nữ sau bức tường đội mũ tím xuất hiện.",
        "explain": "Khi di chuyển trong khu vực ngoại thành khi di chuyển tới gần khu vực ngã ba có phương tiện di chuyển qua lại chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 224,
        "passTo": 246,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 353
      },
      {
        "id": 37,
        "desc": "Phương tiện đang đi thẳng qua nhiều ngõ bất ngờ xe đạp lao nhanh ra",
        "ask": "Khi di chuyển trong khu vực ngoại thành khi di chuyển tới gần khu vực ngã ba có phương tiện di chuyển qua lại chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi người đi xe máy nam vừa khuất khỏi bờ tường",
        "explain": "Khi di chuyển trong khu vực ngoại thành khi di chuyển tới gần khu vực ngã ba có phương tiện di chuyển qua lại chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 205,
        "passTo": 233,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 335
      },
      {
        "id": 38,
        "desc": "Vượt xe tại khúc cua",
        "ask": "Khi di chuyển trong khu vực ngoại thành trời tối tại khúc cua, phía trước có xe máy đi tốc độ thấp chúng ta cần phải làm gì ?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đèn phanh của 2 xe mô tô sáng lên",
        "explain": "Khi di chuyển trong khu vực ngoại thành trời tối tại khúc cua, phía trước có xe máy đi tốc độ thấp chúng ta cần đạp phanh ngay để giữ khoảng cách an toàn. Khi cảm thấy an toàn thì chúng ta tiếp tục đạp chân ga để di chuyển. ",
        "passFrom": 128,
        "passTo": 157,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 277
      },
      {
        "id": 39,
        "desc": "Xe tải nhập làn hẳn vào phía trong",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm bóng xe ô tô chạm vạch đứt dưới đường (xe ô tô chuyển làn tới giữa làn số 3)",
        "explain": "",
        "passFrom": 120,
        "passTo": 141,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 234
      },
      {
        "id": 40,
        "desc": "Xe phía trước bật đèn cảnh báo, xe mô tô lấn làn vượt lên",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe mô tô màu đỏ chạy người chiều vừa xuất hiện sau đuôi xe ô tô",
        "explain": "",
        "passFrom": 107,
        "passTo": 144,
        "videoUrl": "https://raw.githubusercontent.com/luanphamvan/luanphamvan.github.io/main/videos/",
        "duration": 303
      },
      {
        "id": 41,
        "desc": "Xe con phía trước di chuyển với tốc độ cao bất ngời rẽ trái",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm bánh ô tô đè vạch người qua đường và phát tín hiệu xi nhan xe con sáng lên",
        "explain": "",
        "passFrom": 140,
        "passTo": 153,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 290
      },
      {
        "id": 42,
        "desc": "Xe mô tô vượt đèn đỏ bất ngờ cắt ngang xe",
        "ask": "Ấn phím cách (Space) tại thời điểm phát hiện xe mô tô màu đỏ chạy ngược chiều bắt đầu xi nhan trái",
        "explain": "",
        "passFrom": 128,
        "passTo": 140,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 265
      },
      {
        "id": 43,
        "desc": "Xe tải chuyển làn tránh chướng ngại vật",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe tải bắt đầu xi nhan (đèn xe tải sáng lần thứ 2)",
        "explain": "",
        "passFrom": 125,
        "passTo": 160,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 310
      }
    ]
  },
  {
    "id": 2,
    "name": "Giao thông trên đường cao tốc",
    "situations": [
      {
        "id": 44,
        "desc": "Xe con màu trắng chuyển làn cắt ngang đầu xe",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện toàn bộ xe con màu trắng xuất hiện phía bên phải (đèn xi nhan sáng lần 1 vừa tắt) Nếu vừa thấy có ánh sáng đèn xin nhan đã bấm dễ bị vào khoảng ngoài khoảng có điểm",
        "explain": "",
        "passFrom": 121,
        "passTo": 140,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 224
      },
      {
        "id": 45,
        "desc": "Xe tải chuyển làn cắt ngang xe con phía trước",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe tải bắt đầu lấn làn và vừa khuất qua đầu xe con phía trước (đèn xi nhan xe tải vừa bị che khuất)",
        "explain": "",
        "passFrom": 155,
        "passTo": 180,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 277
      },
      {
        "id": 46,
        "desc": "Xe con vượt lên cắt ngang đầu xe",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm nhìn thấy toàn bộ xe con màu trắng qua cửa kính chắn gió phía trước ô tô",
        "explain": "",
        "passFrom": 216,
        "passTo": 250,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 316
      },
      {
        "id": 47,
        "desc": "Nhường đường xe ưu tiên phía sau",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe cấp cứu bật xi nhan xin đường qua gương chiếu hậu trái.",
        "explain": "",
        "passFrom": 130,
        "passTo": 253,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 306
      },
      {
        "id": 48,
        "desc": "Xe chạy sau từ chối khi bạn xin chuyển làn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe của bạn bật đèn xi nhan trái 2 lần",
        "explain": "",
        "passFrom": 91,
        "passTo": 115,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 285
      },
      {
        "id": 49,
        "desc": "Chướng ngại vật phía trước, xe tải chuyển làn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe tải bắt đầu xi nhan chuyển làn bên phải. (đèn xe tải khuất tai gương).",
        "explain": "",
        "passFrom": 124,
        "passTo": 163,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 281
      },
      {
        "id": 50,
        "desc": "Xe tải chuyển làn bên trái",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm đèn xi nhan trái của xe tải sáng lần thứ 2 vừa tắt",
        "explain": "",
        "passFrom": 138,
        "passTo": 174,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 296
      },
      {
        "id": 51,
        "desc": "Xe tải chạy ngược chiều trên cao tốc",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm toàn bộ xe ô tô tải đi ra khỏi đường rẽ (bánh ô tô đỏ quan sát qua gương chạm vạch trắng dưới đường)",
        "explain": "",
        "passFrom": 144,
        "passTo": 182,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 308
      },
      {
        "id": 52,
        "desc": "Xe đậu trên làn dừng đỗ khẩn cấp",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe ô tô con nhìn qua gương khuất 1/2 đầu xe",
        "explain": "",
        "passFrom": 166,
        "passTo": 151,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 294
      },
      {
        "id": 53,
        "desc": "Xe chạy ngược chiều đang dừng trên làn đường dừng đỗ khẩn cấp",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện 2 đèn xe tải dừng ngược chiều",
        "explain": "",
        "passFrom": 161,
        "passTo": 212,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 312
      },
      {
        "id": 54,
        "desc": "Xe tải nhập làn trên cao tốc",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe tải vừa vượt qua cây bên đường nhập làn (nếu bấm dựa vào đèn xi nhan rất dễ bị vào ngoài vùng có điểm)",
        "explain": "",
        "passFrom": 155,
        "passTo": 187,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 262
      },
      {
        "id": 55,
        "desc": "Xe tải bị hư trên cao tốc không có làn dừng đỗ khẩn cấp",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe tải phía trước vừa bật đèn xi nhan trái",
        "explain": "",
        "passFrom": 73,
        "passTo": 101,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 319
      },
      {
        "id": 56,
        "desc": "Xe con xin ra từ làn khẩn cấp",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện ô tô trắng phía trước di chuyển chạm vạch liền trên đường",
        "explain": "",
        "passFrom": 128,
        "passTo": 145,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 222
      },
      {
        "id": 57,
        "desc": "Chướng ngại vật phía trước trên cao tốc",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện cả 2 đèn cảnh báo phát sáng (phía bên phải xe đỏ)",
        "explain": "",
        "passFrom": 262,
        "passTo": 322,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 548
      },
      {
        "id": 58,
        "desc": "Làn đường xe chạy gặp chướng ngại vật",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe ô tô đỏ phía trước bắt đầu phát tín hiệu phanh xe (sáng đèn phanh)",
        "explain": "",
        "passFrom": 235,
        "passTo": 280,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 532
      },
      {
        "id": 59,
        "desc": "Xe tải chuyển làn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đèn xi nhan xe tải sáng lần thứ 2 (vầng sáng trên kính ô tô xuất hiện lần 2)",
        "explain": "",
        "passFrom": 245,
        "passTo": 274,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 367
      },
      {
        "id": 60,
        "desc": "Xe 16 chỗ đi ra từ làn khẩn cấp",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe 16 chỗ đang dừng bắt đầu di chuyển sang làn bên trái, bánh xe sau xe cán lên vạch trắng.",
        "explain": "",
        "passFrom": 98,
        "passTo": 120,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 321
      },
      {
        "id": 61,
        "desc": "Xe phía trước nhập làn liên tục",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe con màu đen chạm vạch đứt sang làn xe trong cùng mà xe của bạn đang chạy",
        "explain": "",
        "passFrom": 174,
        "passTo": 203,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 250
      },
      {
        "id": 62,
        "desc": "Xe đi ngược chiều trên cao tốc",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe đi ngược chiều bên phía trái bắt đầu nháy đèn",
        "explain": "",
        "passFrom": 190,
        "passTo": 234,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 312
      },
      {
        "id": 63,
        "desc": "Gia xúc qua đường trên cao tốc",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện con bò bắt đầu đi vào đường xe chạy, chạm chân vào vạch kẻ trắng",
        "explain": "",
        "passFrom": 106,
        "passTo": 136,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 258
      }
    ]
  },
  {
    "id": 3,
    "name": "Giao thông trên đường núi",
    "situations": [
      {
        "id": 64,
        "desc": "Xe khách phía trước giảm tốc độ trên đoạn đường cong",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện tín hiệu phanh của chiếc xe khách sáng lên và vừa vượt qua biển cảnh báo nguy hiểm bên phía trái",
        "explain": "",
        "passFrom": 155,
        "passTo": 186,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 287
      },
      {
        "id": 65,
        "desc": "Xe khách đi ngược chiều phía trước vượt xe tải trên cung đường đèo dốc",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm ô tô của bạn vừa vượt qua biểm báo khúc cua nguy hiểm và phát hiện đèn xe của xe chạy ngược chiều sáng lên",
        "explain": "",
        "passFrom": 215,
        "passTo": 252,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 367
      },
      {
        "id": 66,
        "desc": "Xe ben phía trước vận chuyển hàng rời thiếu an toàn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe máy khuất 80% ô tô tải phía trước",
        "explain": "",
        "passFrom": 113,
        "passTo": 183,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 250
      },
      {
        "id": 67,
        "desc": "Gia xúc xuất hiện bên đường",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe con phía trước bắt đầu phanh (đèn sau ô tô xanh sáng) đồng thời xuất hiện con vật ven đường",
        "explain": "",
        "passFrom": 170,
        "passTo": 208,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 333
      },
      {
        "id": 68,
        "desc": "Khung đường đồi núi sương mù che khuất tầm nhìn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm áp sát gương cầu lồi và phát hiện xe ô tô đi ngược chiều bật đèn",
        "explain": "",
        "passFrom": 140,
        "passTo": 195,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 319
      },
      {
        "id": 69,
        "desc": "Xe đổ đèo phía trước va chạm",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe chạy ngược chiều phía đằng xa",
        "explain": "",
        "passFrom": 94,
        "passTo": 152,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 305
      },
      {
        "id": 70,
        "desc": "Xe khách chạy ngược chiều vượt container tại khúc đường cong",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đầu xe container ló khỏi vách núi",
        "explain": "",
        "passFrom": 296,
        "passTo": 324,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 480
      },
      {
        "id": 71,
        "desc": "Xe con phía trước bất ngờ giảm tốc độ tấp vào lề đường",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm tín hiệu đèn phanh xe phía trước sáng lên",
        "explain": "",
        "passFrom": 164,
        "passTo": 208,
        "videoUrl": "https://taplai.com/videos/71.mp4",
        "duration": 308
      },
      {
        "id": 72,
        "desc": "Xe tải chạy ngược chiều có tín hiệu xin vượt trên cung đường đồi núi, xương mù che khuất tầm nhìn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe tải ngược chiều bật xi nhan xin vượt trong sương mù",
        "explain": "",
        "passFrom": 209,
        "passTo": 237,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 343
      },
      {
        "id": 73,
        "desc": "Xe con chạy ngược chiều lấn làn vượt xe tải",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện bóng xe con xuất hiện từ đằng xa và chuẩn bị vượt",
        "explain": "",
        "passFrom": 191,
        "passTo": 212,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 318
      }
    ]
  },
  {
    "id": 4,
    "name": "Giao thông trên đường quốc lộ",
    "situations": [
      {
        "id": 74,
        "desc": "Xe đang đi trên đường quốc lộ trời tối xuất hiện đoàn xe đạp",
        "ask": "",
        "explain": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm tín hiệu đèn phanh của xe tải sáng lên",
        "passFrom": 155,
        "passTo": 195,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 333
      },
      {
        "id": 75,
        "desc": "Xe đang chạy bất chợt có quả bóng lăn trên đường",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện người đi bộ chạm chân lên mặt đường",
        "explain": "",
        "passFrom": 121,
        "passTo": 145,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 232
      },
      {
        "id": 76,
        "desc": "Xe đi sau xe chở cồng kềnh có xe sang đường nguy hiểm",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xuất hiện đứa bé chạy băng qua đường",
        "explain": "",
        "passFrom": 73,
        "passTo": 104,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 643
      },
      {
        "id": 77,
        "desc": "Xe đang đi thằng bất ngờ phía trước có người chạy băng qua đường",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm đầu xe ô tô đỏ xuất hiện trước ô tô xám",
        "explain": "",
        "passFrom": 301,
        "passTo": 338,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 560
      },
      {
        "id": 78,
        "desc": "Tình huống vượt xe trên đường",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm đèn tín hiệu vừa chuyển xanh",
        "explain": "",
        "passFrom": 133,
        "passTo": 159,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 250
      },
      {
        "id": 79,
        "desc": "Xe bạn đang đi có xe mô tô từ đường nhánh lao ra",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm thấy 2 chiếc xe máy di chuyển tới đường to, bắt đầu rẽ vào giao lộ",
        "explain": "",
        "passFrom": 144,
        "passTo": 164,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 290
      },
      {
        "id": 80,
        "desc": "Xe mô tô tránh chướng ngại vật gây nguy hiểm cho xe bạn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe ô tô trắng đi vào vạch sơn giảm tốc màu vàng phía trên (có 2 chuỗi vạch sơn giảm tốc) đồng thời đèn nguy hiểm sáng lên. Hoặc thời điểm thấy xe máy bật đèn xi nhan trái (sẽ được 4 điểm) ",
        "explain": "",
        "passFrom": 109,
        "passTo": 124,
        "videoUrl": "https://raw.githubusercontent.com/cocoavn/cocoavn.github.io/main/drive_situations/",
        "duration": 208
      },
      {
        "id": 81,
        "desc": "Ô tô quay đầu trước xe bạn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe bán tải bật xi nhan trái và phần đầu xe bắt đầu chạm biển báo",
        "explain": "",
        "passFrom": 194,
        "passTo": 223,
        "videoUrl": "https://taplai.com/videos/81.mp4",
        "duration": 283
      },
      {
        "id": 82,
        "desc": "Xe tải vượt ẩu",
        "ask": "Tình huống mô phỏng lại khi tham gia giao thông di chuyển trên ngoại ô. Phía bên đường là xe Bus ngay khi phát hiện xe tải sau xe Bus vượt ẩu. Bạn cần phải làm gì",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện nửa đầu xe tải đang có ý định vượt",
        "explain": "Khi tham gia giao thông di chuyển trên ngoại ô. Phía bên đường là xe Bus ngay khi phát hiện xe tải sau xe Bus vượt ẩu. Phải đạp chân phanh từ giây từ 7-12 trong video để giảm tốc độ lại, giữ khoảng cách an toàn quan sát kỹ khi thấy an toàn rồi tiếp tục di chuyển. Bởi nếu tiếp tục đi lên với tốc độ hiện tại có khả năng va chạm giao thông là rất cao.",
        "passFrom": 177,
        "passTo": 216,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 356
      },
      {
        "id": 83,
        "desc": "Xe bạn đang đi thẳng có đàn gia xúc lao ra",
        "ask": "Tình huống mô phỏng lại khi tham gia giao thông di chuyển trên ngoại ô. Ngay khi phát hiện đàn gia xúc có thể vươn ra đường. Bạn cần phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện con bò bắt đầu di chuyển vào phần đường xe chạy",
        "explain": "Khi tham gia giao thông di chuyển trên ngoại ô. Ngay khi phát hiện đàn gia xúc có thể vươn ra đường, bạn cần phải đạp nhẹ chân phanh từ giây thứ 5-12 trong videos để giảm tốc độ lại, giữ khoảng cách an toàn quan sát kỹ khi thấy an toàn rồi tiếp tuc di chuyển. Bởi nếu cứ tiếp tục di chuyển có thể va chạm với đàn gia súc.",
        "passFrom": 114,
        "passTo": 143,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 248
      },
      {
        "id": 84,
        "desc": "Xe đang đi đường thẳng bắt gặp xe phía trước dừng và bật đèn cảnh báo nguy hiểm",
        "ask": "Tình huống mô phỏng lại khi tham gia giao thông di chuyển trên ngoại ô. Ngay khi phát hiện phía trước có xe bật đèn cảnh báo nguy hiểm, bạn định chuyển làn tuy nhiên phía sau đang có xe đi tới. Bạn cần phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện tín hiệu đèn xe con bắt đầu sáng lên",
        "explain": "Khi tham gia giao thông di chuyển trên ngoại ô. Ngay khi phát hiện phía trước có xe bật đèn cảnh báo nguy hiểm, bạn định chuyển làn tuy nhiên phía sau đang có xe đi tới. Bạn cần phải ra nhẹ chân ga từ giây thứ 5-12 trong video để giảm tốc độ lại, giữ khoảng cách an toàn quan sát kỹ khi thấy an toàn rồi tiếp tục di chuyển và thực hiện chuyển làn. Nếu cố tình chuyển làn có thể gây ra tính huống va chạm nguy hiểm.",
        "passFrom": 146,
        "passTo": 170,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 259
      },
      {
        "id": 85,
        "desc": "Mối nguy hiểm khi xe phía trước rơi gỗ",
        "ask": "Tình huống mô phỏng lại khi tham gia giao thông di chuyển trên ngoại ô. Ngay khi phát hiện xe phía trước chở gỗ và có cây gỗ sắp tụt ra ngoài rất nguy hiểm. Bạn cần phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe phía trước phanh (đèn phanh xe bật sáng)",
        "explain": "Khi tham gia giao thông di chuyển trên ngoại ô. Ngay khi phát hiện xe phía trước chở gỗ và có cây gỗ sắp tụt ra ngoài rất nguy hiểm, thì bạn cần phải đạp phanh giảm tốc độ lại, nếu cần thiết dừng hẳn lại để quan sát khi nào thật sự an toàn mới tiếp tục di chuyển",
        "passFrom": 201,
        "passTo": 224,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 337
      },
      {
        "id": 86,
        "desc": "Mối nguy hiểm ổ gà trên đường",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe ô tô con phía trước bắt đầu chuyển hướng, bánh xe trước sắp chạm vạch liền",
        "explain": "",
        "passFrom": 78,
        "passTo": 118,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 246
      },
      {
        "id": 87,
        "desc": "Phương tiện qua đường sắt không rào chắn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm thấy rõ gờ giảm tốc màu vàng",
        "explain": "",
        "passFrom": 74,
        "passTo": 119,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 284
      },
      {
        "id": 88,
        "desc": "Xe máy lách sang làn đường xe của bạn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe máy bật tín hiệu xi nhan bắt đầu rẽ trái.",
        "explain": "",
        "passFrom": 138,
        "passTo": 159,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 231
      },
      {
        "id": 89,
        "desc": "Xe đạp sang đường thiếu quan sát",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe đạp bắt đầu sang phần đường của mình",
        "explain": "",
        "passFrom": 134,
        "passTo": 162,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 249
      },
      {
        "id": 90,
        "desc": "Xe máy đi ngược chiều gây nguy hiểm",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện xe bán tải phía trước bật xi nhan phải để tránh mô tô đi người chiều phía trước",
        "explain": "",
        "passFrom": 110,
        "passTo": 143,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 234
      }
    ]
  },
  {
    "id": 5,
    "name": "Tình huống gây ra tai nạn giao thông thực tế",
    "situations": [
      {
        "id": 91,
        "desc": "Xe lùi trên cao tốc va chạm với container chở hàng",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm có xe đang bật đèn cảnh báo. (Biểm báo 50M vừa khuất tầm nhìn - ngay phía trước biển báo là đường rẽ)",
        "explain": "",
        "passFrom": 98,
        "passTo": 142,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 262
      },
      {
        "id": 92,
        "desc": "Xe máy vượt ẩu gây tai nạn nghiêm trọng",
        "ask": "Tình huống mô phỏng lại khi tham gia giao thông trên đường. Ngay khi định sang đường thì bắt gặp xe tải đang đi hướng ngược. Bạn phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đầu xe khách ngược chiều xuất hiện (xe máy đi song song với xe tải)",
        "explain": "Đây là tình huống dẫn đến va chạm giao thông rất nguy hiểm, các bạn đặc biệt lưu ý khi sang đường quan sát trước sau khi nào thấy thực sự an toàn thì mới sang đường.",
        "passFrom": 266,
        "passTo": 295,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 432
      },
      {
        "id": 93,
        "desc": "Xe con xin chuyển làn gấp cắt ngang đầu xe",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe taxi trắng xi nhan chuyển làn sang phải",
        "explain": "",
        "passFrom": 91,
        "passTo": 126,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 242
      },
      {
        "id": 94,
        "desc": "Tai nạn liên hoàn giữa các xe khách",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe đỗ phía trước cùng làn nháy đèn",
        "explain": "",
        "passFrom": 125,
        "passTo": 255,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 356
      },
      {
        "id": 95,
        "desc": "Mất lái đâm vào người điều khiển giao thông",
        "ask": "Tình huống mô tả khi tham gia giao thông trên đường, xe khách vượt ẩu mất lái đâm và người tham gia giao thông. Bạn phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi thấy thanh chắn cảnh báo phía trước sáng đèn.",
        "explain": "Hành vi vượt ẩu khi tham gia giao thông này bị nghiêm cấm, nếu gặp tình huống tương tự các bạn vui lòng phanh lại giữ khoảng cách an toàn",
        "passFrom": 98,
        "passTo": 146,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 233
      },
      {
        "id": 96,
        "desc": "Mất lái đâm vào xe phía trước",
        "ask": "Khi tham gia giao thông bạn phát hiện xe phía trước có biểu hiện chết máy ở giữa đường, bạn cần phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm đèn sau xe con ở làn giữa sáng đèn",
        "explain": "",
        "passFrom": 196,
        "passTo": 228,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 257
      },
      {
        "id": 97,
        "desc": "Vượt ẩu gây tai nạn giao thông",
        "ask": "Khi tham gia giao thông ở các khu vực đường cong, đường vòng khuất tầm nhìn. Bạn cần phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đầu xe khách xuất hiện",
        "explain": "Như tình huống trên tài xế xe khách đã lấn làn khi không có đủ tầm nhìn gây tai nạn nguy hiểm",
        "passFrom": 175,
        "passTo": 192,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 297
      },
      {
        "id": 98,
        "desc": "Lái xe đường đèo vượt ẩu gây tai nạn",
        "ask": "Khi lái xe khách trên đường đèo phía trước gặp chướng ngại vật và bên đường đang có rất nhiều xe lưu thông. Bạn cần phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm xuất hiện rõ đụn đất và các biển cảnh báo công trường, đồng thời là lúc bạn thấy đầu xe khách",
        "explain": "Ở tình huống này xe khách đã cố tình vượt ẩu dẫn đến tai nạn giao thông",
        "passFrom": 185,
        "passTo": 215,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 342
      },
      {
        "id": 99,
        "desc": "Xe kéo rơ móoc đâm vào xe tải trong hầm",
        "ask": "Khi tham gia giao thông trong hầm ngay khi phát hiện xe kéo rơ móoc có hành vi vượt ẩu, bạn phải làm gì",
        "howPass": "Ấn phím cách (Space) tại thời điểm 2 xe ngược chiều cùng lúc sáng đèn (4 đèn xe xuất hiện cùng lúc)",
        "explain": "Như tình huống này xe khách không giảm tốc độ và giữ khoảng cách an toàn nên không tránh kịp dẫn tới xảy ra tai nạn giao thông.",
        "passFrom": 200,
        "passTo": 235,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 317
      },
      {
        "id": 100,
        "desc": "Vượt đường tàu va chạm với tàu hỏa",
        "ask": "Khi tham gia giao thông băng qua đường giao cắt với đường sắt, khi phát hiện phía trước có tàu hỏa đang đi qua. Bạn phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện tàu hỏa xuất hiện",
        "explain": "Ở tình huống này xe khách đã cố tình vượt nên đã gây ra tai nạn giao thông nghiêm trọng",
        "passFrom": 120,
        "passTo": 150,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 251
      },
      {
        "id": 101,
        "desc": "Sang đường thiếu quan sát vượt đường tàu và va chạm với tàu hỏa",
        "ask": "Khi tham gia giao thông băng qua đường giao cắt với đường sắt, khi phát hiện phía trước có tàu hỏa đang đi qua. Bạn cần phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi đến ngã rẽ và bạn thấy đèn đỏ cảnh báo phía bên trái",
        "explain": "Ở tình huống này xe khách đã cố tình vượt ẩu dẫn đến tai nạn giao thông",
        "passFrom": 158,
        "passTo": 181,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 308
      },
      {
        "id": 102,
        "desc": "Di chuyển trên đường cao tốc thiếu quan sát và va chạm với xe cứu hỏa đi ngược chiều",
        "ask": "Khi tham gia giao thông bắt gặp xe cứu hỏa đi ngược chiều",
        "howPass": "Ấn phím cách (Space) tại thời điểm ngay khi thấy xe cứu hỏa đi hết đoạn cua ngược chiều",
        "explain": "Vì xe cứu hỏa là xe ưu tiên đang làm nhiệm vụ cấp bách nên bạn cần phải nhường đường ở tình huống này. Xe khách không nhường nên đã gây tai nạn nghiêm trọng",
        "passFrom": 156,
        "passTo": 192,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 273
      },
      {
        "id": 103,
        "desc": "Va chạm với xe con vượt ẩu hướng đối diện",
        "ask": "Khi tham gia giao thông ngay khi phát hiện xe con hướng đối diện vượt ẩu, bạn cần phải làm gì?",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe ô tô con màu đỏ chuyển hướng",
        "explain": "Ở tính huống này nếu không giữ khoảng cách an toàn sẽ ngay lập tức có sự van chạm giao thông xảy ra",
        "passFrom": 193,
        "passTo": 223,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 300
      },
      {
        "id": 104,
        "desc": "Lái xe trong tình trạng không tỉnh táo",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phát hiện đuôi xe con màu đen phía trước sáng đèn và khi gương chiếu hậu xuất hiện xe máy",
        "explain": "",
        "passFrom": 191,
        "passTo": 221,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 280
      },
      {
        "id": 105,
        "desc": "Đường ban đêm có xe ngược chiều",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi xe tải ngườc chiều xuất hiện sau 2 giây (sau 2 giây từ lúc nhìn thấy đèn xe tải sáng). Nếu không áng được chính xác bạn có thể bấm khi thấy sẽ tải đang hướng thẳng đến xe bạn từ xa",
        "explain": "",
        "passFrom": 150,
        "passTo": 173,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 254
      },
      {
        "id": 106,
        "desc": "Lái xe trong đường sương mù",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm thấy biển công trường đang thi công.",
        "explain": "",
        "passFrom": 208,
        "passTo": 227,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 343
      },
      {
        "id": 107,
        "desc": "Vượt xe không có tầm nhìn",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi thấy đèn xi nhan trái (trên màn điều khiển) sáng",
        "explain": "",
        "passFrom": 120,
        "passTo": 139,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 273
      },
      {
        "id": 108,
        "desc": "Lái xe trong thời tiết xấu",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm đầu xe tải màu đỏ cam ngược chiều xuất hiện",
        "explain": "",
        "passFrom": 203,
        "passTo": 219,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 266
      },
      {
        "id": 109,
        "desc": "Lái xe trong khu dân cư",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi thấy ô tô 16 chỗ trong ngõ thông qua khoảng trống (chú ý, bấm trc khi xe đến ngã ba)",
        "explain": "",
        "passFrom": 132,
        "passTo": 164,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 256
      },
      {
        "id": 110,
        "desc": "Lái xe quá tốc độ",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm tầm nhìn biển \"Giao nhau với đường không ưu tiên\" phía bên phải sắp khuất",
        "explain": "",
        "passFrom": 132,
        "passTo": 162,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 274
      },
      {
        "id": 111,
        "desc": "Xe ngược chiều vượt lên",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi thấy xe ngược chiều màu đỏ xuất hiện, đầu xe đỏ chạm vạch làn bên cạnh",
        "explain": "",
        "passFrom": 135,
        "passTo": 164,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 203
      },
      {
        "id": 112,
        "desc": "Vượt xe khi có xe ngược chiều",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi xe ngược chiều ở xa xuất hiện đồng thời bụi cỏ dưới lòng đường vừa khuất tầm nhìn",
        "explain": "",
        "passFrom": 96,
        "passTo": 157,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 262
      },
      {
        "id": 113,
        "desc": "Đi qua ngã tư",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe bắt đầu di chuyển khi đèn tín hiệu chuyển xanh và đầu xe ô tô con bên trái xuất hiện",
        "explain": "",
        "passFrom": 136,
        "passTo": 154,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 201
      },
      {
        "id": 114,
        "desc": "Lái xe ban đêm đi qua cầu",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi xe vừa đi qua cổng cầu, qua 2 thanh trụ đầu tiên.",
        "explain": "",
        "passFrom": 136,
        "passTo": 180,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 323
      },
      {
        "id": 115,
        "desc": "Tình huống ở ngã ba khu dân cư",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm phần đầu xe máy khuất qua đầu xe con phía trước",
        "explain": "",
        "passFrom": 116,
        "passTo": 130,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 202
      },
      {
        "id": 116,
        "desc": "Xe đi trên đường đèo nguy hiểm",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm khi đi qua biển báo khoảng 1s",
        "explain": "",
        "passFrom": 189,
        "passTo": 213,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 270
      },
      {
        "id": 117,
        "desc": "Ngã ba trong khu dân cư",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm khuất biển ngã tư nguy hiểm và thấy ô tô che hết xe máy phía trước.(hoặc ô tô sáng đèn)",
        "explain": "",
        "passFrom": 121,
        "passTo": 146,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 204
      },
      {
        "id": 118,
        "desc": "Rẽ phải gặp xe ngược chiều",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe bắt đầu vào ngã rẽ và tắt đèn xi nhan",
        "explain": "",
        "passFrom": 140,
        "passTo": 171,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 248
      },
      {
        "id": 119,
        "desc": "Xe phía trước vượt gấp",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm xe tải phía trước có đèn tín hiệu xi nhan trái.",
        "explain": "",
        "passFrom": 103,
        "passTo": 130,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 254
      },
      {
        "id": 120,
        "desc": "Xe phía trước thắng gấp",
        "ask": "",
        "howPass": "Ấn phím cách (Space) tại thời điểm ngay khi phanh xe của xe tải phía trước sáng đèn",
        "explain": "",
        "passFrom": 124,
        "passTo": 145,
        "videoUrl": "https://taplai.com/videos/82.mp4",
        "duration": 291
      }
    ]
  }
]
